information-technology/operating-system/linux/lfs/lfs.org
:PROPERTIES:
:ID:       9E8D8B59-2FC0-4DFB-8DD6-B775DC563643
:END:
#+title: lfs

Linux From Scratch (LFS) is a project that provides you with step-by-step instructions for building your own customized Linux system entirely from source.

Here are the benefits of building LFS given by the LFS website:
- LFS teaches people how a Linux system works internally.
- Building LFS produces a very compact Linux system.
- LFS is extremely flexible.
- LFS offers you added security.



The benefits exactly macth my needs:
- I want to understand how a linux operating system works.
- I want a clear OS.
- I wang an OS specilized to my usecase.
- I want keep my data safe, no data sent to the companies like Windows, Apple or Canonical.





* Prerequisites

[[id:BB16B28A-EDD0-42EB-8132-7C224666E1A4][building and installing software package]]


* Instrocution


The LFS system will be built by using an already installed Linux distribution. This existing Linux system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the “development” option during the distribution installation to include these tools.


** Things to Mention
Apart from a brief explanation of the problem being experienced, any request for help should include these essential things:
- The version of the book being used (in this case 12.1)
- The host distribution and version being used to create LFS
- The output from the Host System Requirements script
- The package or section the problem was encountered in
- The exact error message, or a clear description of the problem
- Note whether you have deviated from the book at all


** Configure Script Problems
If something goes wrong while running the =configure= script, review the =config.log= file. This file may contain errors encountered during configure which were not printed to the screen. Include the relevant lines if you need to ask for help.


** Compilation Problems
Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the =configure= script and the =make= run can be helpful. It is not necessary to include the entire output, but do include all of the relevant information. Here is an example of the type of information to include from the make screen output.

#+begin_example
gcc -DALIASPATH=\"/mnt/lfs/usr/share/locale:.\"
-DLOCALEDIR=\"/mnt/lfs/usr/share/locale\"
-DLIBDIR=\"/mnt/lfs/usr/lib\"
-DINCLUDEDIR=\"/mnt/lfs/usr/include\" -DHAVE_CONFIG_H -I. -I.
-g -O2 -c getopt1.c
gcc -g -O2 -static -o make ar.o arscan.o commands.o dir.o
expand.o file.o function.o getopt.o implicit.o job.o main.o
misc.o read.o remake.o rule.o signame.o variable.o vpath.o
default.o remote-stub.o version.o opt1.o
-lutil job.o: In function `load_too_high':
/lfs/tmp/make-3.79.1/job.c:1565: undefined reference
to `getloadavg'
collect2: ld returned 1 exit status
make[2]: *** [make] Error 1
make[2]: Leaving directory `/lfs/tmp/make-3.79.1'
make[1]: *** [all-recursive] Error 1
make[1]: Leaving directory `/lfs/tmp/make-3.79.1'
make: *** [all-recursive-am] Error 2
#+end_example

In this case, many people would just include the bottom section:

#+begin_example
make [2]: *** [make] Error 1
#+end_example

This is not enough information to diagnose the problem, because it only notes that something went wrong, not what went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and all the associated error messages.



* Preparing for the Build
** Preparing the Host System
*** Host System Requirements

[[file:scripts/version-check.sh]]

*** Creating a New Partition


Like most other operating systems, LFS is usually installed on a dedicated partition. The recommended approach to building an LFS system is to use an available empty partition or, if you have enough unpartitioned space, to create one.



A minimal system requires a partition of around 10 gigabytes (GB). This is enough to store all the source tarballs and compile the packages. However, if the LFS system is intended to be the primary Linux system, additional software will probably be installed which will require additional space. A 30 GB partition is a reasonable size to provide for growth. The LFS system itself will not take up this much room. A large portion of this requirement is to provide sufficient free temporary storage as well as for adding additional capabilities after LFS is complete. Additionally, compiling packages can require a lot of disk space which will be reclaimed after the package is installed.



Because there is not always enough Random Access Memory (RAM) available for compilation processes, it is a good idea to use a small disk partition as swap space. This is used by the kernel to store seldom-used data and leave more memory available for active processes. The swap partition for an LFS system can be the same as the one used by the host system, in which case it is not necessary to create another one.


**** The Root Partion
A root LFS partition (not to be confused with the /root directory) of twenty gigabytes is a good compromise for most systems. It provides enough space to build LFS and most of BLFS, but is small enough so that multiple partitions can be easily created for experimentation.


