information-technology/operating-system/linux/lfs/lfs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-10 Sun 23:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>lfs</title>
<meta name="author" content="Mingming Li" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">lfs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org758ba06">1. Prerequisites</a></li>
<li><a href="#orgbee7e6a">2. Instrocution</a>
<ul>
<li><a href="#org3e3f4bf">2.1. Things to Mention</a></li>
<li><a href="#org48e76be">2.2. Configure Script Problems</a></li>
<li><a href="#org30560e2">2.3. Compilation Problems</a></li>
</ul>
</li>
<li><a href="#orgae31524">3. Preparing for the Build</a>
<ul>
<li><a href="#org8f5259d">3.1. Preparing the Host System</a>
<ul>
<li><a href="#org5201822">3.1.1. Host System Requirements</a></li>
<li><a href="#org3bb0243">3.1.2. Creating a New Partition</a></li>
<li><a href="#org93cc16a">3.1.3. Creating a File System on the Partition</a></li>
<li><a href="#org021449e">3.1.4. Setting the $LFS Variable</a></li>
<li><a href="#orgd9c849d">3.1.5. Mounting the New Partition</a></li>
</ul>
</li>
<li><a href="#org505037a">3.2. Packages and Patches</a></li>
<li><a href="#orgd7b9c29">3.3. Final Preparations</a></li>
</ul>
</li>
<li><a href="#org8d1ec33">4. Building the LFS Cross Toolchain and Temporary Tools</a></li>
<li><a href="#org182cc81">5. Building the LFS System</a></li>
</ul>
</div>
</div>
<p>
Linux From Scratch (LFS) is a project that provides you with step-by-step instructions for building your own customized Linux system entirely from source.<br />
</p>

<p>
Here are the benefits of building LFS given by the LFS website:<br />
</p>
<ul class="org-ul">
<li>LFS teaches people how a Linux system works internally.<br /></li>
<li>Building LFS produces a very compact Linux system.<br /></li>
<li>LFS is extremely flexible.<br /></li>
<li>LFS offers you added security.<br /></li>
</ul>



<p>
The benefits exactly macth my needs:<br />
</p>
<ul class="org-ul">
<li>I want to understand how a linux operating system works.<br /></li>
<li>I want a clear OS.<br /></li>
<li>I wang an OS specilized to my usecase.<br /></li>
<li>I want keep my data safe, no data sent to the companies like Windows, Apple or Canonical.<br /></li>
</ul>





<div id="outline-container-org758ba06" class="outline-2">
<h2 id="org758ba06"><span class="section-number-2">1.</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="building-and-installing-software-package-for-linux.html#ID-BB16B28A-EDD0-42EB-8132-7C224666E1A4">building and installing software package</a><br />
</p>
</div>
</div>


<div id="outline-container-orgbee7e6a" class="outline-2">
<h2 id="orgbee7e6a"><span class="section-number-2">2.</span> Instrocution</h2>
<div class="outline-text-2" id="text-2">
<p>
The LFS system will be built by using an already installed Linux distribution. This existing Linux system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the “development” option during the distribution installation to include these tools.<br />
</p>
</div>


<div id="outline-container-org3e3f4bf" class="outline-3">
<h3 id="org3e3f4bf"><span class="section-number-3">2.1.</span> Things to Mention</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Apart from a brief explanation of the problem being experienced, any request for help should include these essential things:<br />
</p>
<ul class="org-ul">
<li>The version of the book being used (in this case 12.1)<br /></li>
<li>The host distribution and version being used to create LFS<br /></li>
<li>The output from the Host System Requirements script<br /></li>
<li>The package or section the problem was encountered in<br /></li>
<li>The exact error message, or a clear description of the problem<br /></li>
<li>Note whether you have deviated from the book at all<br /></li>
</ul>
</div>
</div>


<div id="outline-container-org48e76be" class="outline-3">
<h3 id="org48e76be"><span class="section-number-3">2.2.</span> Configure Script Problems</h3>
<div class="outline-text-3" id="text-2-2">
<p>
If something goes wrong while running the <code>configure</code> script, review the <code>config.log</code> file. This file may contain errors encountered during configure which were not printed to the screen. Include the relevant lines if you need to ask for help.<br />
</p>
</div>
</div>


<div id="outline-container-org30560e2" class="outline-3">
<h3 id="org30560e2"><span class="section-number-3">2.3.</span> Compilation Problems</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the <code>configure</code> script and the <code>make</code> run can be helpful. It is not necessary to include the entire output, but do include all of the relevant information. Here is an example of the type of information to include from the make screen output.<br />
</p>

<pre class="example" id="org9922697">
gcc -DALIASPATH=\"/mnt/lfs/usr/share/locale:.\"
-DLOCALEDIR=\"/mnt/lfs/usr/share/locale\"
-DLIBDIR=\"/mnt/lfs/usr/lib\"
-DINCLUDEDIR=\"/mnt/lfs/usr/include\" -DHAVE_CONFIG_H -I. -I.
-g -O2 -c getopt1.c
gcc -g -O2 -static -o make ar.o arscan.o commands.o dir.o
expand.o file.o function.o getopt.o implicit.o job.o main.o
misc.o read.o remake.o rule.o signame.o variable.o vpath.o
default.o remote-stub.o version.o opt1.o
-lutil job.o: In function `load_too_high':
/lfs/tmp/make-3.79.1/job.c:1565: undefined reference
to `getloadavg'
collect2: ld returned 1 exit status
make[2]: *** [make] Error 1
make[2]: Leaving directory `/lfs/tmp/make-3.79.1'
make[1]: *** [all-recursive] Error 1
make[1]: Leaving directory `/lfs/tmp/make-3.79.1'
make: *** [all-recursive-am] Error 2
</pre>

<p>
In this case, many people would just include the bottom section:<br />
</p>

<pre class="example" id="orga020492">
make [2]: *** [make] Error 1
</pre>

<p>
This is not enough information to diagnose the problem, because it only notes that something went wrong, not what went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and all the associated error messages.<br />
</p>
</div>
</div>
</div>



<div id="outline-container-orgae31524" class="outline-2">
<h2 id="orgae31524"><span class="section-number-2">3.</span> Preparing for the Build</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8f5259d" class="outline-3">
<h3 id="org8f5259d"><span class="section-number-3">3.1.</span> Preparing the Host System</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5201822" class="outline-4">
<h4 id="org5201822"><span class="section-number-4">3.1.1.</span> Host System Requirements</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<a href="scripts/version-check.sh">scripts/version-check.sh</a><br />
</p>
</div>
</div>

<div id="outline-container-org3bb0243" class="outline-4">
<h4 id="org3bb0243"><span class="section-number-4">3.1.2.</span> Creating a New Partition</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Like most other operating systems, LFS is usually installed on a dedicated partition. The recommended approach to building an LFS system is to use an available empty partition or, if you have enough unpartitioned space, to create one.<br />
</p>



<p>
A minimal system requires a partition of around 10 gigabytes (GB). This is enough to store all the source tarballs and compile the packages. However, if the LFS system is intended to be the primary Linux system, additional software will probably be installed which will require additional space. A 30 GB partition is a reasonable size to provide for growth. The LFS system itself will not take up this much room. A large portion of this requirement is to provide sufficient free temporary storage as well as for adding additional capabilities after LFS is complete. Additionally, compiling packages can require a lot of disk space which will be reclaimed after the package is installed.<br />
</p>



<p>
Because there is not always enough Random Access Memory (RAM) available for compilation processes, it is a good idea to use a small disk partition as swap space. This is used by the kernel to store seldom-used data and leave more memory available for active processes. The swap partition for an LFS system can be the same as the one used by the host system, in which case it is not necessary to create another one.<br />
</p>
</div>


<ol class="org-ol">
<li><a id="org4174b0d"></a>The Root Partion<br />
<div class="outline-text-5" id="text-3-1-2-1">
<p>
A root LFS partition (not to be confused with the /root directory) of twenty gigabytes is a good compromise for most systems. It provides enough space to build LFS and most of BLFS, but is small enough so that multiple partitions can be easily created for experimentation.<br />
</p>
</div>
</li>
