information-technology/operating-system/linux/lfs/lfs.html


<li><a id="org4867674"></a>The Swap Partition<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
Most distributions automatically create a swap partition. Generally the recommended size of the swap partition is about twice the amount of physical RAM, however this is rarely needed. If disk space is limited, hold the swap partition to two gigabytes and monitor the amount of disk swapping.<br />
</p>

<p>
If you want to use the hibernation feature (suspend-to-disk) of Linux, it writes out the contents of RAM to the swap partition before turning off the machine. In this case the size of the swap partition should be at least as large as the system's installed RAM.<br />
</p>

<p>
Swapping is never good. For mechanical hard drives you can generally tell if a system is swapping by just listening to disk activity and observing how the system reacts to commands. With an SSD you will not be able to hear swapping, but you can tell how much swap space is being used by running the top or free programs. Use of an SSD for a swap partition should be avoided if possible. The first reaction to swapping should be to check for an unreasonable command such as trying to edit a five gigabyte file. If swapping becomes a normal occurrence, the best solution is to purchase more RAM for your system.<br />
</p>
</div>
</li>


<li><a id="org1cb94ee"></a>The Grub Bios Partition<br />
<div class="outline-text-5" id="text-3-1-2-3">
<p>
If the boot disk has been partitioned with a GUID Partition Table (GPT), then a small, typically 1 MB, partition must be created if it does not already exist. This partition is not formatted, but must be available for GRUB to use during installation of the boot loader. This partition will normally be labeled 'BIOS Boot' if using fdisk or have a code of EF02 if using the gdisk command.<br />
</p>
</div>
</li>



<li><a id="orgf2844b5"></a>Convenience Partitions<br />
<div class="outline-text-5" id="text-3-1-2-4">
<p>
There are several other partitions that are not required, but should be considered when designing a disk layout. The following list is not comprehensive, but is meant as a guide.<br />
</p>
<ul class="org-ul">
<li>/boot – Highly recommended. Use this partition to store kernels and other booting information. To minimize potential boot problems with larger disks, make this the first physical partition on your first disk drive. A partition size of 200 megabytes is adequate.<br /></li>
<li>/boot/efi – The EFI System Partition, which is needed for booting the system with UEFI. Read the BLFS page for details.<br /></li>
<li>/home – Highly recommended. Share your home directory and user customization across multiple distributions or LFS builds. The size is generally fairly large and depends on available disk space.<br /></li>
<li>/usr – In LFS, /bin, /lib, and /sbin are symlinks to their counterparts in /usr. So /usr contains all the binaries needed for the system to run. For LFS a separate partition for /usr is normally not needed. If you create it anyway, you should make a partition large enough to fit all the programs and libraries in the system. The root partition can be very small (maybe just one gigabyte) in this configuration, so it's suitable for a thin client or diskless workstation (where /usr is mounted from a remote server). However, you should be aware that an initramfs (not covered by LFS) will be needed to boot a system with a separate /usr partition.<br /></li>
<li>/opt – This directory is most useful for BLFS, where multiple large packages like KDE or Texlive can be installed without embedding the files in the /usr hierarchy. If used, 5 to 10 gigabytes is generally adequate.<br /></li>
<li>/tmp – A separate /tmp partition is rare, but useful if configuring a thin client. This partition, if used, will usually not need to exceed a couple of gigabytes. If you have enough RAM, you can mount a tmpfs on /tmp to make access to temporary files faster.<br /></li>
<li>/usr/src – This partition is very useful for providing a location to store BLFS source files and share them across LFS builds. It can also be used as a location for building BLFS packages. A reasonably large partition of 30-50 gigabytes provides plenty of room.<br /></li>
</ul>


<p>
Any separate partition that you want automatically mounted when the system starts must be specified in the /etc/fstab file.<br />
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org93cc16a" class="outline-4">
<h4 id="org93cc16a"><span class="section-number-4">3.1.3.</span> Creating a File System on the Partition</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
A partition is just a range of sectors on a disk drive, delimited by boundaries set in a partition table. Before the operating system can use a partition to store any files, the partition must be formatted to contain a file system, typically consisting of a label, directory blocks, data blocks, and an indexing scheme to locate a particular file on demand. The file system also helps the OS keep track of free space on the partition, reserve the needed sectors when a new file is created or an existing file is extended, and recycle the free data segments created when files are deleted. It may also provide support for data redundancy, and for error recovery.<br />
</p>



<p>
LFS can use any file system recognized by the Linux kernel, but the most common types are ext3 and ext4. The choice of the right file system can be complex; it depends on the characteristics of the files and the size of the partition. For example:<br />
</p>
<dl class="org-dl">
<dt>ext2</dt><dd>is suitable for small partitions that are updated infrequently such as /boot.<br /></dd>
<dt>ext3</dt><dd>is an upgrade to ext2 that includes a journal to help recover the partition's status in the case of an unclean shutdown. It is commonly used as a general purpose file system.<br /></dd>
<dt>ext4</dt><dd>is the latest version of the ext family of file systems. It provides several new capabilities including nano-second timestamps, creation and use of very large files (up to 16 TB), and speed improvements.<br /></dd>
</dl>


<p>
LFS assumes that the root file system (/) is of type ext4. To create an ext4 file system on the LFS partition, issue the following command:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">mkfs -v -t ext4 /dev/&lt;xxx&gt;
# Replace &lt;xxx&gt; with the name of the LFS partition.

# -t, --type type
# Specify the type of filesystem to be built.
</pre>
</div>



<p>
If you are using an existing swap partition, there is no need to format it. If a new swap partition was created, it will need to be initialized with this command:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">mkswap /dev/&lt;yyy&gt;
# Replace &lt;yyy&gt; with the name of the swap partition.
</pre>
</div>
</div>
</div>



<div id="outline-container-org021449e" class="outline-4">
<h4 id="org021449e"><span class="section-number-4">3.1.4.</span> Setting the $LFS Variable</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Throughout this book, the environment variable LFS will be used several times. You should ensure that this variable is always defined throughout the LFS build process. It should be set to the name of the directory where you will be building your LFS system - we will use /mnt/lfs as an example, but you may choose any directory name you want. If you are building LFS on a separate partition, this directory will be the mount point for the partition. Choose a directory location and set the variable with the following command:<br />
</p>

<div class="org-src-container">
<pre class="src src-shell">export LFS=/mnt/lfs
</pre>
</div>


<p>
Do not forget to check that LFS is set whenever you leave and reenter the current working environment (such as when doing a su to root or another user). Check that the LFS variable is set up properly with:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">echo $LFS
</pre>
</div>
</div>
</div>
