information-technology/operating-system/linux/lfs/lfs.org
*** Mounting the New Partition
The partition must be mounted so the host system can access it. Strictly speaking, one cannot “mount a partition.” One mounts the file system embedded in that partition. But since a single partition can't contain more than one file system, people often speak of the partition and the associated file system as if they were one and the same.



Create the mount point and mount the LFS file system with these commands:
#+begin_src shell
  mkdir -pv $LFS
  mount -v -t ext4 /dev/<xxx> $LFS
  # Replace <xxx> with the name of the LFS partition.
#+end_src


If you are using multiple partitions for LFS (e.g., one for / and another for /home), mount them like this:
#+begin_src shell
  mkdir -pv $LFS
  # -p, --parents
  # no error if existing, make parent directories as needed
  mount -v -t ext4 /dev/<xxx> $LFS
  mkdir -v $LFS/home
  mount -v -t ext4 /dev/<yyy> $LFS/home
  # Replace <xxx> and <yyy> with the appropriate partition names.
#+end_src


Ensure that this new partition is not mounted with permissions that are too restrictive (such as the nosuid or nodev options). Run the =mount= command without any parameters to see what options are set for the mounted LFS partition. If nosuid and/or nodev are set, the partition must be remounted.


If you are using a swap partition, ensure that it is enabled using the =swapon= command:
#+begin_src shell
  /sbin/swapon -v /dev/<zzz>
  # Replace <zzz> with the name of the swap partition.
#+end_src
** Packages and Patches


This chapter includes a list of packages that need to be downloaded in order to build a basic Linux system. Downloaded packages and patches will need to be stored somewhere that is conveniently available throughout the entire build. A working directory is also required to unpack the sources and build them. =$LFS/sources= can be used both as the place to store the tarballs and patches and as a working directory. By using this directory, the required elements will be located on the LFS partition and will be available during all stages of the building process.


To create this directory, execute the following command, as user root, before starting the download session:
#+begin_src shell
  mkdir -v $LFS/sources
#+end_src


Make this directory writable and sticky. “Sticky” means that even if multiple users have write permission on a directory, only the owner of a file can delete the file within a sticky directory. The following command will enable the write and sticky modes:
#+begin_src shell
  chmod -v a+wt $LFS/sources
#+end_src



There are several ways to obtain all the necessary packages and patches to build LFS:
- The files can be downloaded individually.
- For stable versions of the book, a tarball of all the needed files can be downloaded from one of the mirror sites listed at https://www.linuxfromscratch.org/mirrors.html#files.
- The files can be downloaded using =wget= and a wget-list.


To download all of the packages and patches by using wget-list-sysv as an input to the =wget= command, use:
#+begin_src shell
  wget --input-file=wget-list-sysv --continue --directory-prefix=$LFS/sources
#+end_src


There is a separate file, md5sums, which can be used to verify that all the correct packages are available before proceeding. Place that file in =$LFS/sources= and run:
#+begin_src shell
  pushd $LFS/sources 		# change to the directory $LFS/sources
  md5sum -c md5sums
  popd				# return back to the original directory
#+end_src

This check can be used after retrieving the needed files with any of the methods listed above.


If the packages and patches are downloaded as a non-root user, these files will be owned by the user. The file system records the owner by its UID, and the UID of a normal user in the host distro is not assigned in LFS. So the files will be left owned by an unnamed UID in the final LFS system. If you won't assign the same UID for your user in the LFS system, change the owners of these files to root now to avoid this issue:
#+begin_src shell
  chown root:root $LFS/sources/*
#+end_src

** Final Preparations

* Building the LFS Cross Toolchain and Temporary Tools

* Building the LFS System

  
 


