information-technology/operating-system/linux/lfs/lfs.html


<div id="outline-container-orgd9c849d" class="outline-4">
<h4 id="orgd9c849d"><span class="section-number-4">3.1.5.</span> Mounting the New Partition</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
The partition must be mounted so the host system can access it. Strictly speaking, one cannot “mount a partition.” One mounts the file system embedded in that partition. But since a single partition can't contain more than one file system, people often speak of the partition and the associated file system as if they were one and the same.<br />
</p>



<p>
Create the mount point and mount the LFS file system with these commands:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir -pv $LFS
mount -v -t ext4 /dev/&lt;xxx&gt; $LFS
# Replace &lt;xxx&gt; with the name of the LFS partition.
</pre>
</div>


<p>
If you are using multiple partitions for LFS (e.g., one for / and another for /home), mount them like this:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir -pv $LFS
# -p, --parents
# no error if existing, make parent directories as needed
mount -v -t ext4 /dev/&lt;xxx&gt; $LFS
mkdir -v $LFS/home
mount -v -t ext4 /dev/&lt;yyy&gt; $LFS/home
# Replace &lt;xxx&gt; and &lt;yyy&gt; with the appropriate partition names.
</pre>
</div>


<p>
Ensure that this new partition is not mounted with permissions that are too restrictive (such as the nosuid or nodev options). Run the <code>mount</code> command without any parameters to see what options are set for the mounted LFS partition. If nosuid and/or nodev are set, the partition must be remounted.<br />
</p>


<p>
If you are using a swap partition, ensure that it is enabled using the <code>swapon</code> command:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">/sbin/swapon -v /dev/&lt;zzz&gt;
# Replace &lt;zzz&gt; with the name of the swap partition.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org505037a" class="outline-3">
<h3 id="org505037a"><span class="section-number-3">3.2.</span> Packages and Patches</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This chapter includes a list of packages that need to be downloaded in order to build a basic Linux system. Downloaded packages and patches will need to be stored somewhere that is conveniently available throughout the entire build. A working directory is also required to unpack the sources and build them. <code>$LFS/sources</code> can be used both as the place to store the tarballs and patches and as a working directory. By using this directory, the required elements will be located on the LFS partition and will be available during all stages of the building process.<br />
</p>


<p>
To create this directory, execute the following command, as user root, before starting the download session:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir -v $LFS/sources
</pre>
</div>


<p>
Make this directory writable and sticky. “Sticky” means that even if multiple users have write permission on a directory, only the owner of a file can delete the file within a sticky directory. The following command will enable the write and sticky modes:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">chmod -v a+wt $LFS/sources
</pre>
</div>



<p>
There are several ways to obtain all the necessary packages and patches to build LFS:<br />
</p>
<ul class="org-ul">
<li>The files can be downloaded individually.<br /></li>
<li>For stable versions of the book, a tarball of all the needed files can be downloaded from one of the mirror sites listed at <a href="https://www.linuxfromscratch.org/mirrors.html#files">https://www.linuxfromscratch.org/mirrors.html#files</a>.<br /></li>
<li>The files can be downloaded using <code>wget</code> and a wget-list.<br /></li>
</ul>


<p>
To download all of the packages and patches by using wget-list-sysv as an input to the <code>wget</code> command, use:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">wget --input-file=wget-list-sysv --continue --directory-prefix=$LFS/sources
</pre>
</div>


<p>
There is a separate file, md5sums, which can be used to verify that all the correct packages are available before proceeding. Place that file in <code>$LFS/sources</code> and run:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">pushd $LFS/sources 		# change to the directory $LFS/sources
md5sum -c md5sums
popd				# return back to the original directory
</pre>
</div>

<p>
This check can be used after retrieving the needed files with any of the methods listed above.<br />
</p>


<p>
If the packages and patches are downloaded as a non-root user, these files will be owned by the user. The file system records the owner by its UID, and the UID of a normal user in the host distro is not assigned in LFS. So the files will be left owned by an unnamed UID in the final LFS system. If you won't assign the same UID for your user in the LFS system, change the owners of these files to root now to avoid this issue:<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">chown root:root $LFS/sources/*
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7b9c29" class="outline-3">
<h3 id="orgd7b9c29"><span class="section-number-3">3.3.</span> Final Preparations</h3>
</div>
</div>

<div id="outline-container-org8d1ec33" class="outline-2">
<h2 id="org8d1ec33"><span class="section-number-2">4.</span> Building the LFS Cross Toolchain and Temporary Tools</h2>
</div>

<div id="outline-container-org182cc81" class="outline-2">
<h2 id="org182cc81"><span class="section-number-2">5.</span> Building the LFS System</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mingming Li</p>
<p class="date">Created: 2024-03-10 Sun 23:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>